
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_asn.device[0] will be destroyed
  # (because netbox_asn.device is not in configuration)
  - resource "netbox_asn" "device" {
      - asn         = 4200000677 -> null
      - description = "R70 (FranzFreunde)" -> null
      - id          = "11" -> null
      - rir_id      = 12 -> null
      - tags        = [] -> null
      - tags_all    = [] -> null
        # (1 unchanged attribute hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "CR3:CR3-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 35 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
        name            = "CR3-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/35/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "CR4:CR4-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 31 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
        name            = "CR4-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/31/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T22:11:39Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 188 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
        name            = "CR5-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/188/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "CR6:CR6-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 37 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:18Z" -> (known after apply)
        name            = "CR6-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/37/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "CR3:CR3-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 41 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:18Z" -> (known after apply)
        name            = "CR3-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/41/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "CR4:CR4-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 43 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
        name            = "CR4-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/43/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T22:11:39Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 189 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
        name            = "CR5-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/189/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "CR6:CR6-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 42 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:18Z" -> (known after apply)
        name            = "CR6-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 11 -> 16
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/42/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 33 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/33/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "R70:R70-CR4-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 32 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:18Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR4-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/32/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "R70:R70-CR5-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 29 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:20Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR5-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/29/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "R70:R70-CR6-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 30 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:18Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR6-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/30/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 38 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/38/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR4-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 39 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR4-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/39/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR5-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 34 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:21Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR5-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/34/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "R70:R70-CR6-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 40 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-07T22:42:19Z" -> (known after apply)
      ~ local_as        = 11 -> 16
        name            = "R70-CR6-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/40/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_asn.device[0] will be destroyed
  # (because netbox_asn.device is not in configuration)
  - resource "netbox_asn" "device" {
      - asn         = 4200000681 -> null
      - description = "ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)" -> null
      - id          = "12" -> null
      - rir_id      = 12 -> null
      - tags        = [] -> null
      - tags_all    = [] -> null
        # (1 unchanged attribute hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:21Z" -> (known after apply)
      ~ display         = "CR3:CR3-ext-freifunk-troisdorf-126b9c8-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 192 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:21Z" -> (known after apply)
        name            = "CR3-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/192/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:21Z" -> (known after apply)
      ~ display         = "CR4:CR4-ext-freifunk-troisdorf-126b9c8-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 193 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:21Z" -> (known after apply)
        name            = "CR4-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/193/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:21Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-ext-freifunk-troisdorf-126b9c8-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 191 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:21Z" -> (known after apply)
        name            = "CR5-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/191/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:21Z" -> (known after apply)
      ~ display         = "CR6:CR6-ext-freifunk-troisdorf-126b9c8-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 194 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:21Z" -> (known after apply)
        name            = "CR6-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/194/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "CR3:CR3-ext-freifunk-troisdorf-126b9c8-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 203 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
        name            = "CR3-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/203/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:23Z" -> (known after apply)
      ~ display         = "CR4:CR4-ext-freifunk-troisdorf-126b9c8-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 204 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:23Z" -> (known after apply)
        name            = "CR4-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/204/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:23Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-ext-freifunk-troisdorf-126b9c8-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 206 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:23Z" -> (known after apply)
        name            = "CR5-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/206/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:23Z" -> (known after apply)
      ~ display         = "CR6:CR6-ext-freifunk-troisdorf-126b9c8-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 205 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:23Z" -> (known after apply)
        name            = "CR6-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 12 -> 14
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/205/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 197 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/197/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR4-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 195 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR4-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/195/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR5-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 198 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR5-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/198/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR6-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 196 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR6-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/196/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 201 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/201/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR4-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 199 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR4-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/199/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR5-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 202 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR5-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/202/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-126b9c8:ext-freifunk-troisdorf-126b9c8-CR6-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 200 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-10T17:45:22Z" -> (known after apply)
      ~ local_as        = 12 -> 14
        name            = "ext-freifunk-troisdorf-126b9c8-CR6-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/200/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_asn.device[0] will be destroyed
  # (because netbox_asn.device is not in configuration)
  - resource "netbox_asn" "device" {
      - asn         = 4200000682 -> null
      - description = "ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> null
      - id          = "13" -> null
      - rir_id      = 12 -> null
      - tags        = [] -> null
      - tags_all    = [] -> null
        # (1 unchanged attribute hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "CR3:CR3-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 219 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
        name            = "CR3-ext-freifunk-troisdorf-87e76b3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/219/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "CR4:CR4-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 221 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
        name            = "CR4-ext-freifunk-troisdorf-87e76b3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/221/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 222 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
        name            = "CR5-ext-freifunk-troisdorf-87e76b3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/222/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "CR6:CR6-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 220 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
        name            = "CR6-ext-freifunk-troisdorf-87e76b3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/220/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "CR3:CR3-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 212 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:40Z" -> (known after apply)
        name            = "CR3-ext-freifunk-troisdorf-87e76b3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/212/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "CR4:CR4-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 214 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:40Z" -> (known after apply)
        name            = "CR4-ext-freifunk-troisdorf-87e76b3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/214/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 209 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:40Z" -> (known after apply)
        name            = "CR5-ext-freifunk-troisdorf-87e76b3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/209/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "CR6:CR6-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 213 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:40Z" -> (known after apply)
        name            = "CR6-ext-freifunk-troisdorf-87e76b3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 13 -> 15
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/213/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 215 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/215/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR4-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 216 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR4-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/216/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR5-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 217 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR5-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/217/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR6-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 218 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR6-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/218/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 208 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/208/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR4-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 210 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR4-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/210/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR5-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 211 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR5-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/211/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:39Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR6-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 207 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T20:16:39Z" -> (known after apply)
      ~ local_as        = 13 -> 15
        name            = "ext-freifunk-troisdorf-87e76b3-CR6-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/207/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 48 to change, 3 to destroy.
```